Tekla.Structures.Analysis.AnalysisCrossSection.analysisSubSections
The sub sections of the analysis cross section.

Tekla.Structures.Analysis.AnalysisCrossSection.Select
Selects an analysis cross section.
The AnalysisModelName and ID/Name have to be set.

Tekla.Structures.Analysis.AnalysisCrossSection.Delete
Deletes an analysis cross section.
The AnalysisModelName and ID have to be set.